Revit 2025 API
GraphicsStyleType Enumeration
Describes the type of graphics style.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum GraphicsStyleType
Public Enumeration GraphicsStyleType
public enum class GraphicsStyleType
type GraphicsStyleType
Members
Member name | Value | Description
Projection | 1 | Projection.
Cut | 2 | Cut.
See Also
Reference
Autodesk.Revit.DB Namespace